In [2]:
import seaborn as sns
import pandas as pd
from scipy.stats import f_oneway as annova

In [3]:
df=sns.load_dataset("titanic")
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [18]:
df['pclass'].unique()
df=df[['pclass','age']].dropna()

In [19]:
#by comparing quntative and categorcal data age and claa
class_1=df[df['pclass']==1]['age']
class_2=df[df['pclass']==2]['age']
class_3=df[df['pclass']==3]['age']

In [20]:
f_stats,p_value=annova(class_1,class_2,class_3)
f_stats

np.float64(57.443484340676214)

In [24]:
alpha=0.05
if p_value < alpha:
    print("i will reject the null hypothesus there is diffenrence between atlect one passenger clas")
else :
    print("i will accept null hypothesis")

i will reject the null hypothesus there is diffenrence between atlect one passenger clas